spec/fixtures/vcr_cassettes/deposit/create.yml

---
http_interactions:
- request:
    method: post
    uri: https://admin.vanilapay.com/api/v2/deposit
    body:
      encoding: UTF-8
      string: '{"order_id":"123","method":"wallet-card","amount":"5000.0","account":"12345","notification_url":"http://some.url/callback","success_url":"http://some.url/callback","fail_url":"http://some.url/callback","card_number":"4242424242424242","card_expire":"01/25","card_cvv":"123","ext_txn":"123","ext_date":"2020-01-01T00:00:00+03:00","ext_email":"test@mail.com","ext_ip":"127.0.0.1","ext_recipient_system":"Payeer
        EUR","ext_recipient":"P121321","ext_c_to":"PREUR","card_type":"visa"}'
    headers:
      Authorization:
      - Bearer wE5V6Jh51mdh3ZQ1LuJCDZC6Gw6SHvZ9curDSEBmdSjh8CDCS33puZJ71fGNgzmx
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Wed, 19 Apr 2023 14:29:01 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Powered-By:
      - PHP/8.1.11
      Cache-Control:
      - no-cache, private
      Content-Language:
      - ru_RU
      Vary:
      - Accept-Language
      Cf-Cache-Status:
      - DYNAMIC
      Report-To:
      - '{"endpoints":[{"url":"https:\/\/a.nel.cloudflare.com\/report\/v3?s=ziaUU1rvJQTX1J%2Fytsy7TiPSeYA4Bok5T6k7R91IhWgfyzwMhM4c%2B5JjBFd6SHD%2F4iXibHZBDxvkyjIk04jq%2FIWA6s3cDm4jihAsuzlEH2tZOr4WlaF3sK5LUJ%2BQnI31Q56pFA7d"}],"group":"cf-nel","max_age":604800}'
      Nel:
      - '{"success_fraction":0,"report_to":"cf-nel","max_age":604800}'
      Server:
      - cloudflare
      Cf-Ray:
      - 7ba5d6568babc27a-VIE
      Alt-Svc:
      - h3=":443"; ma=86400, h3-29=":443"; ma=86400
    body:
      encoding: UTF-8
      string: '{"id":"507122561","created_at":"2023-04-19T17:29:00+03:00","updated_at":"2023-04-19T17:29:01+03:00","action":"deposit","method":"wallet-card","payment_id":"332529680","order_id":"123","account":"12345","amount":"5000.00","payment_amount":"0.00","commission":"25.00","comment":null,"status":"process","payment_url":null,"payment_code":null,"payment_error_code":null,"payment_error":null,"currency":"RUB"}'
    http_version:
  recorded_at: Wed, 19 Apr 2023 14:29:01 GMT
recorded_with: VCR 5.1.0
